In [50]:
import pandas as pd

### pandas数据类型
Pandas 基于两种数据类型，series 和 dataframe。  

series 是一种一维的数据类型，其中的每个元素都有各自的标签。如果你之前看过这个系列关于 Numpy 的推文，你可以把它当作一个由带标签的元素组成的 numpy 数组。标签可以是数字或者字符。

dataframe 是一个二维的、表格型的数据结构。Pandas 的 dataframe 可以储存许多不同类型的数据，并且每个轴都有标签。你可以把它当作一个 series 的字典。

In [51]:
df = pd.read_csv("../sources/uk_rain_2014.csv", header=0)  # header 关键字告诉 Pandas 哪些是数据的列名
df.head(5)  # 查看前 x 行的数据
df.tail(5)  # 查看后 x 行的数据

,Water Year,Rain (mm) Oct-Sep,Outflow (m3/s) Oct-Sep,Rain (mm) Dec-Feb,Outflow (m3/s) Dec-Feb,Rain (mm) Jun-Aug,Outflow (m3/s) Jun-Aug
28,2008/09,1139,4941,268,6690,323,3189
29,2009/10,1103,4738,255,6435,244,1958
30,2010/11,1053,4521,265,6593,267,2885
31,2011/12,1285,5500,339,7630,379,5261
32,2012/13,1090,5329,350,9615,187,1797

In [52]:
# 修改列名称
df.columns = ['water_year','rain_octsep', 'outflow_octsep',
              'rain_decfeb', 'outflow_decfeb', 'rain_junaug', 'outflow_junaug']
df.head(5)

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
0,1980/81,1182,5408,292,7248,174,2212
1,1981/82,1098,5112,257,7316,242,1936
2,1982/83,1156,5701,330,8567,124,1802
3,1983/84,993,4265,391,8905,141,1078
4,1984/85,1182,5364,217,5813,343,4313

In [53]:
len(df)  # 有多少行数据

33

In [54]:
pd.options.display.float_format = "{:,.3f}".format  # 格式化float显示3位小数点后
df.describe()  # 获得统计数据

,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
count,33.000,33.000,33.000,33.000,33.000,33.000
mean,"1,129.000","5,019.182",325.364,"7,926.545",237.485,"2,439.758"
std,101.900,658.588,69.995,"1,692.800",66.168,"1,025.914"
min,856.000,"3,479.000",206.000,"4,578.000",103.000,"1,078.000"
25%,"1,053.000","4,506.000",268.000,"6,690.000",193.000,"1,797.000"
50%,"1,139.000","5,112.000",309.000,"7,630.000",229.000,"2,142.000"
75%,"1,182.000","5,497.000",360.000,"8,905.000",280.000,"2,959.000"
max,"1,387.000","6,391.000",484.000,"11,486.000",379.000,"5,261.000"

In [55]:
df["water_year"]  # 获得一个series，可以直接用df.water_year访问

0     1980/81
1     1981/82
2     1982/83
3     1983/84
4     1984/85
5     1985/86
6     1986/87
7     1987/88
8     1988/89
9     1989/90
10    1990/91
11    1991/92
12    1992/93
13    1993/94
14    1994/95
15    1995/96
16    1996/97
17    1997/98
18    1998/99
19    1999/00
20    2000/01
21    2001/02
22    2002/03
23    2003/04
24    2004/05
25    2005/06
26    2006/07
27    2007/08
28    2008/09
29    2009/10
30    2010/11
31    2011/12
32    2012/13
Name: water_year, dtype: object

In [56]:
df.outflow_octsep < 1000  # 布尔过滤，返回dataframe

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
Name: outflow_octsep, dtype: bool

In [57]:
df[(df.outflow_octsep<5000) & (df.outflow_octsep>4300)]

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
5,1985/86,1027,4991,304,7951,229,2595
8,1988/89,976,4330,309,6465,200,1440
9,1989/90,1130,4973,470,10520,209,1740
10,1990/91,1022,4418,305,7120,216,1923
11,1991/92,1151,4506,246,5493,280,2118
17,1997/98,1169,4953,341,7747,285,3206
22,2002/03,1021,4366,272,7093,176,1478
24,2004/05,1095,4547,309,7183,217,1799
28,2008/09,1139,4941,268,6690,323,3189
29,2009/10,1103,4738,255,6435,244,1958
30,2010/11,1053,4521,265,6593,267,2885

In [58]:
df[df.water_year.str.startswith('199')]  # 字符串过滤

,water_year,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
10,1990/91,1022,4418,305,7120,216,1923
11,1991/92,1151,4506,246,5493,280,2118
12,1992/93,1130,5246,308,8751,219,2551
13,1993/94,1162,5583,422,10109,193,1638
14,1994/95,1110,5370,484,11486,103,1231
15,1995/96,856,3479,245,5515,172,1439
16,1996/97,1047,4019,258,5770,256,2102
17,1997/98,1169,4953,341,7747,285,3206
18,1998/99,1268,5824,360,8771,225,2240
19,1999/00,1204,5665,417,10021,197,2166

In [59]:
df.iloc[30]  # iloc 只对数字型的标签有用。它会返回给定行的 series

water_year        2010/11
rain_octsep          1053
outflow_octsep       4521
rain_decfeb           265
outflow_decfeb       6593
rain_junaug           267
outflow_junaug       2885
Name: 30, dtype: object

In [60]:
df = df.set_index(["water_year"])  # 用某一列索引，当你将一列设置为索引的时候，它就不再是数据的一部分了，
df.head(5)

,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
water_year,,,,,,
1980/81,1182,5408,292,7248,174,2212
1981/82,1098,5112,257,7316,242,1936
1982/83,1156,5701,330,8567,124,1802
1983/84,993,4265,391,8905,141,1078
1984/85,1182,5364,217,5813,343,4313

In [61]:
df.loc["1984/85"]  # 字符型索引

rain_octsep       1182
outflow_octsep    5364
rain_decfeb        217
outflow_decfeb    5813
rain_junaug        343
outflow_junaug    4313
Name: 1984/85, dtype: int64

In [62]:
df.sort_index(ascending=False).head(5) #inplace=True to apple the sorting in place

,rain_octsep,outflow_octsep,rain_decfeb,outflow_decfeb,rain_junaug,outflow_junaug
water_year,,,,,,
2012/13,1090,5329,350,9615,187,1797
2011/12,1285,5500,339,7630,379,5261
2010/11,1053,4521,265,6593,267,2885
2009/10,1103,4738,255,6435,244,1958
2008/09,1139,4941,268,6690,323,3189

In [ ]:
df = df.reset_index("water_year")  # 恢复索引为数据
df.head(5)